Revit 2018 API
Material.SurfacePatternColor Property
 The color of the material surface pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public Color SurfacePatternColor { get; set; }
Visual Basic
Public Property SurfacePatternColor As Color
	Get
	Set
Visual C++
public:
property Color^ SurfacePatternColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
Material Class
Autodesk.Revit.DB Namespace